._design_docs/.test_reports/mtp-jinja-run-20260609-V2/S12-MTP-B01-V2-Joriginal/legacy/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260609-V2\S12-MTP-B01-V2-Joriginal\legacy\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 11 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m01.0s/5m0s  00/11 shared iters
warmup      [   0% ] 1 VUs  0m01.0s/2m0s  0/1 shared iters

running (0m02.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   9% ] 1 VUs  0m02.0s/5m0s  01/11 shared iters
warmup      [   0% ] 1 VUs  0m02.0s/2m0s  0/1 shared iters

running (0m03.0s), 1/2 VUs, 3 complete and 0 interrupted iterations
hit_probe   [  18% ] 1 VUs  0m03.0s/5m0s  02/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  27% ] 1 VUs  0m04.0s/5m0s  03/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m05.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  36% ] 1 VUs  0m05.0s/5m0s  04/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m06.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  45% ] 1 VUs  0m06.0s/5m0s  05/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m07.0s), 1/2 VUs, 7 complete and 0 interrupted iterations
hit_probe   [  55% ] 1 VUs  0m07.0s/5m0s  06/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m08.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
hit_probe   [  64% ] 1 VUs  0m08.0s/5m0s  07/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m09.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
hit_probe   [  73% ] 1 VUs  0m09.0s/5m0s  08/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m10.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  82% ] 1 VUs  0m10.0s/5m0s  09/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters

running (0m11.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
hit_probe   [  91% ] 1 VUs  0m11.0s/5m0s  10/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=90.90%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    prefix_match_rate
    ✓ 'rate>=0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 12      1.089878/s
    checks_succeeded...: 100.00% 12 out of 12
    checks_failed......: 0.00%   0 out of 12

    ✓ probe 200
    ✓ warmup 200

    CUSTOM
    cache_hit_prompt_ms............: avg=101.53ms min=98.74ms  med=100.67ms p(95)=106.16ms max=107.37ms
    cache_hit_rate.................: 90.90%  10 out of 11
    cache_miss_prompt_ms...........: avg=290.86ms min=102.63ms med=290.86ms p(95)=460.26ms max=479.09ms
    cache_n_tokens.................: avg=3.666667 min=0        med=4        p(95)=4        max=4       
    prefix_match_rate..............: 100.00% 11 out of 11
    requests_ok....................: 12      1.089878/s

    HTTP
    http_req_duration..............: avg=990.16ms min=793.94ms med=807.65ms p(95)=1.71s    max=1.97s   
      { expected_response:true }...: avg=990.16ms min=793.94ms med=807.65ms p(95)=1.71s    max=1.97s   
    http_req_failed................: 0.00%   0 out of 12
    http_reqs......................: 12      1.089878/s

    EXECUTION
    iteration_duration.............: avg=1.09s    min=894.36ms med=907.97ms p(95)=1.85s    max=2.17s   
    iterations.....................: 12      1.089878/s
    vus............................: 1       min=1        max=2
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 22 kB   2.0 kB/s
    data_sent......................: 3.1 kB  279 B/s



running (0m11.0s), 0/2 VUs, 12 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m11.0s/5m0s  11/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m02.2s/2m0s  1/1 shared iters